Revit 2026 API

# AreaLoadCreate(Document, ElementId, IListCurveLoop, IListXYZ, IListInt32, IListInt32, AreaLoadType) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static AreaLoad Create(
	Document document,
	ElementId hostElemId,
	IList<CurveLoop> loops,
	IList<XYZ> forceVectors,
	IList<int> refPointCurveIndexes,
	IList<int> refPointCurveEnds,
	AreaLoadType symbol
)
```
```vb
Public Shared Function Create (
	document As Document,
	hostElemId As ElementId,
	loops As IList(Of CurveLoop),
	forceVectors As IList(Of XYZ),
	refPointCurveIndexes As IList(Of Integer),
	refPointCurveEnds As IList(Of Integer),
	symbol As AreaLoadType
) As AreaLoad
```
```cpp
public:
static AreaLoad^ Create(
	Document^ document,
	ElementId^ hostElemId,
	IList<CurveLoop^>^ loops,
	IList<XYZ^>^ forceVectors,
	IList<int>^ refPointCurveIndexes,
	IList<int>^ refPointCurveEnds,
	AreaLoadType^ symbol
)
```
```fsharp
static member Create :
        document : Document *
        hostElemId : ElementId *
        loops : IList<CurveLoop> *
        forceVectors : IList<XYZ> *
        refPointCurveIndexes : IList<int> *
        refPointCurveEnds : IList<int> *
        symbol : AreaLoadType -> AreaLoad
```

#### Parameters

document Document

hostElemId ElementId

loops IListCurveLoop

forceVectors IListXYZ

refPointCurveIndexes IListInt32

refPointCurveEnds IListInt32

symbol AreaLoadType

#### Return Value

AreaLoad

#### Reference

AreaLoad Class

Create Overload

Autodesk.Revit.DB.Structure Namespace